## Plans :thumbsup:
## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## AWS-EKS :thumbsup:
**Dir**: AWS-EKS
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_security_group_rule.allow_http will be created
+   resource "aws_security_group_rule" "allow_http" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       from_port                = 8000
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 8000
+       type                     = "ingress"
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be created
+   resource "aws_cloudwatch_log_group" "this" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = "/aws/eks/eks-cluster/cluster"
+       name_prefix       = (known after apply)
+       retention_in_days = 90
+       skip_destroy      = false
+       tags_all          = (known after apply)
    }

  # module.eks.aws_eks_cluster.this[0] will be created
+   resource "aws_eks_cluster" "this" {
+       arn                       = (known after apply)
+       certificate_authority     = (known after apply)
+       cluster_id                = (known after apply)
+       created_at                = (known after apply)
+       enabled_cluster_log_types = [
+           "api",
+           "audit",
+           "authenticator",
        ]
+       endpoint                  = (known after apply)
+       id                        = (known after apply)
+       identity                  = (known after apply)
+       name                      = "eks-cluster"
+       platform_version          = (known after apply)
+       role_arn                  = (known after apply)
+       status                    = (known after apply)
+       tags_all                  = (known after apply)
+       version                   = "1.27"

+       kubernetes_network_config {
+           ip_family         = (known after apply)
+           service_ipv4_cidr = (known after apply)
+           service_ipv6_cidr = (known after apply)
        }

+       timeouts {}

+       vpc_config {
+           cluster_security_group_id = (known after apply)
+           endpoint_private_access   = true
+           endpoint_public_access    = true
+           public_access_cidrs       = [
+               "0.0.0.0/0",
            ]
+           security_group_ids        = (known after apply)
+           subnet_ids                = (known after apply)
+           vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "eks.amazonaws.com"
                        }
+                       Sid       = "EKSClusterAssumeRole"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "eks-cluster-cluster-"
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = "eks-cluster-cluster"
+           policy = jsonencode(
                {
+                   Statement = [
+                       {
+                           Action   = [
+                               "logs:CreateLogGroup",
                            ]
+                           Effect   = "Deny"
+                           Resource = "*"
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            )
        }
    }

  # module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
+       role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
+       role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] will be created
+   resource "aws_security_group" "cluster" {
+       arn                    = (known after apply)
+       description            = "EKS cluster security group"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "eks-cluster-cluster-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "eks-cluster-cluster"
        }
+       tags_all               = {
+           "Name" = "eks-cluster-cluster"
        }
+       vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group.node[0] will be created
+   resource "aws_security_group" "node" {
+       arn                    = (known after apply)
+       description            = "EKS node shared security group"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "eks-cluster-node-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name"                              = "eks-cluster-node"
+           "kubernetes.io/cluster/eks-cluster" = "owned"
        }
+       tags_all               = {
+           "Name"                              = "eks-cluster-node"
+           "kubernetes.io/cluster/eks-cluster" = "owned"
        }
+       vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group_rule.cluster["egress_nodes_443"] will be created
+   resource "aws_security_group_rule" "cluster" {
+       description              = "Cluster API to node groups"
+       from_port                = 443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"] will be created
+   resource "aws_security_group_rule" "cluster" {
+       description              = "Cluster API to node kubelets"
+       from_port                = 10250
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 10250
+       type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
+   resource "aws_security_group_rule" "cluster" {
+       description              = "Node groups to cluster API"
+       from_port                = 443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["egress_cluster_443"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node groups to cluster API"
+       from_port                = 443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_https"] will be created
+   resource "aws_security_group_rule" "node" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Egress all HTTPS to internet"
+       from_port                = 443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_ntp_tcp"] will be created
+   resource "aws_security_group_rule" "node" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Egress NTP/TCP to internet"
+       from_port                = 123
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 123
+       type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_ntp_udp"] will be created
+   resource "aws_security_group_rule" "node" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Egress NTP/UDP to internet"
+       from_port                = 123
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "udp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 123
+       type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node CoreDNS"
+       from_port                = 53
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 53
+       type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_self_coredns_udp"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node CoreDNS"
+       from_port                = 53
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "udp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 53
+       type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node groups"
+       from_port                = 443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node kubelets"
+       from_port                = 10250
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 10250
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node CoreDNS"
+       from_port                = 53
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 53
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node CoreDNS"
+       from_port                = 53
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "udp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 53
+       type                     = "ingress"
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
+   resource "aws_default_network_acl" "this" {
+       arn                    = (known after apply)
+       default_network_acl_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       tags                   = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-default"
+           "Terraform"   = "true"
        }
+       tags_all               = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-default"
+           "Terraform"   = "true"
        }
+       vpc_id                 = (known after apply)

+       egress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
        }
+       egress {
+           action     = "allow"
+           cidr_block = "0.0.0.0/0"
+           from_port  = 0
+           protocol   = "-1"
+           rule_no    = 100
+           to_port    = 0
        }

+       ingress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
        }
+       ingress {
+           action     = "allow"
+           cidr_block = "0.0.0.0/0"
+           from_port  = 0
+           protocol   = "-1"
+           rule_no    = 100
+           to_port    = 0
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
+   resource "aws_default_route_table" "default" {
+       arn                    = (known after apply)
+       default_route_table_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       route                  = (known after apply)
+       tags                   = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-default"
+           "Terraform"   = "true"
        }
+       tags_all               = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-default"
+           "Terraform"   = "true"
        }
+       vpc_id                 = (known after apply)

+       timeouts {
+           create = "5m"
+           update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
+   resource "aws_default_security_group" "this" {
+       arn                    = (known after apply)
+       description            = (known after apply)
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-default"
+           "Terraform"   = "true"
        }
+       tags_all               = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-default"
+           "Terraform"   = "true"
        }
+       vpc_id                 = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc"
+           "Terraform"   = "true"
        }
+       tags_all = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc"
+           "Terraform"   = "true"
        }
+       vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1a"
+           "Terraform"   = "true"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1a"
+           "Terraform"   = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1b"
+           "Terraform"   = "true"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1b"
+           "Terraform"   = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-public"
+           "Terraform"   = "true"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-public"
+           "Terraform"   = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1a"
+           "Terraform"   = "true"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1a"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1b"
+           "Terraform"   = "true"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1b"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.101.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-public-us-east-1a"
+           "Terraform"   = "true"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-public-us-east-1a"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.102.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-public-us-east-1b"
+           "Terraform"   = "true"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-public-us-east-1b"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc"
+           "Terraform"   = "true"
        }
+       tags_all                             = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc"
+           "Terraform"   = "true"
        }
    }

  # module.eks.module.eks_managed_node_group["green"].aws_eks_node_group.this[0] will be created
+   resource "aws_eks_node_group" "this" {
+       ami_type               = (known after apply)
+       arn                    = (known after apply)
+       capacity_type          = "SPOT"
+       cluster_name           = "eks-cluster"
+       disk_size              = (known after apply)
+       id                     = (known after apply)
+       instance_types         = [
+           "t3.medium",
        ]
+       node_group_name        = (known after apply)
+       node_group_name_prefix = "green-"
+       node_role_arn          = (known after apply)
+       release_version        = (known after apply)
+       resources              = (known after apply)
+       status                 = (known after apply)
+       subnet_ids             = (known after apply)
+       tags                   = {
+           "Name" = "green"
        }
+       tags_all               = {
+           "Name" = "green"
        }
+       version                = "1.27"

+       launch_template {
+           id      = (known after apply)
+           name    = (known after apply)
+           version = (known after apply)
        }

+       scaling_config {
+           desired_size = 2
+           max_size     = 3
+           min_size     = 2
        }

+       timeouts {}

+       update_config {
+           max_unavailable            = (known after apply)
+           max_unavailable_percentage = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["green"].aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
+                       Sid       = "EKSNodeAssumeRole"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       description           = "EKS managed node group IAM role"
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "green-eks-node-group-"
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["green"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
+       role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["green"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
+       role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["green"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
+       role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["green"].aws_launch_template.this[0] will be created
+   resource "aws_launch_template" "this" {
+       arn                    = (known after apply)
+       default_version        = (known after apply)
+       description            = "Custom launch template for green EKS managed node group"
+       id                     = (known after apply)
+       latest_version         = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "green-"
+       tags_all               = (known after apply)
+       update_default_version = true
+       vpc_security_group_ids = (known after apply)

+       metadata_options {
+           http_endpoint               = "enabled"
+           http_protocol_ipv6          = (known after apply)
+           http_put_response_hop_limit = 2
+           http_tokens                 = "required"
+           instance_metadata_tags      = (known after apply)
        }

+       monitoring {
+           enabled = true
        }

+       tag_specifications {
+           resource_type = "instance"
+           tags          = {
+               "Name" = "green"
            }
        }
+       tag_specifications {
+           resource_type = "network-interface"
+           tags          = {
+               "Name" = "green"
            }
        }
+       tag_specifications {
+           resource_type = "volume"
+           tags          = {
+               "Name" = "green"
            }
        }
    }

  # module.eks.module.eks_managed_node_group["green"].aws_security_group.this[0] will be created
+   resource "aws_security_group" "this" {
+       arn                    = (known after apply)
+       description            = "EKS managed node group security group"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "green-eks-node-group-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "green-eks-node-group"
        }
+       tags_all               = {
+           "Name" = "green-eks-node-group"
        }
+       vpc_id                 = (known after apply)
    }

Plan: 45 to add, 0 to change, 0 to destroy.

```


</details>

## Cost Estimation
**Total Monthly Difference: -9.42 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| AWS-EKS | default | 101.25 | 91.83 | -9.42|
| | **Total** | **101.25** | **91.83** | **-9.42** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
